<template>
  <n-layout content-style="padding: 48px;">
    <article>
      <n-h1 style="text-align: center">
        互联网网站适老化通用设计规范 （工业信息化部）
      </n-h1>
      <section>
        <n-h2 prefix="bar">
          一、适用范围
        </n-h2>
        <n-p>
          本规范规定了互联网网站适老化通用设计规范和技术要求，适用于各种终端的适老化网站设计，也适用于网站的适老化改造与技术开发。
        </n-p>
        <n-h2 prefix="bar">
          二、服务原则
        </n-h2>

        <n-h3>
          <b>1. 以人为本的人机交互</b>
        </n-h3>
        <n-p>
          应做到界面元素的简约化、服务形式的差异化、信息内容的扁平化、功能标识的统一化和操作流程的一致性，并符合《信息技术
          互联网内容无障碍可访问性技术要求与测试方法》等国家标准。
        </n-p>

        <n-h3>
          <b>2. 提供多种的操作方式</b>
        </n-h3>
        <n-p>
          计算机网站至少提供全程键盘和特大鼠标这两种操作方式，移动网站应增加快速定位、语音阅读等规范性的适老化智能手势。在兼容性方面，网页应为各类辅助技术和语音识别等人工智能技术的访问操作，规范相应的服务功能与对应的标识信息。
        </n-p>

        <n-h3>
          <b>3. 实现多样的推送形式</b>
        </n-h3>
        <n-p>
          在网页提供特大字体、背景色高对比、文字放大和语音阅读服务等辅助阅读的同时，应提供简约界面版本和信息影像化的人工智能推送形式，以支持老年人感知网页内容、获取服务。
        </n-p>

        <n-h3>
          <b>4. 形成有效的服务闭环</b>
        </n-h3>
        <n-p>
          提供适老化服务的计算机和移动网站，应在用户的操作系统桌面上，提供直接进入适老化服务快捷方式或客户端，以形成有效的适老化及无障碍服务的闭环。
        </n-p>
        <n-h2 prefix="bar">
          三、技术要求
        </n-h2>
        <n-h3>1. 可感知性</n-h3>
        <n-p>
          <ul style="list-style: none">
            <li>
              <b>1.1 标识与描述</b>
              <ul style="list-style: none">
                <li>
                  <b>1.1.1 整体信息。</b>应设置描述当前页面整体服务类型、信息状况和信息结构的语音阅读引导操作机制，并易于老年用户辨识理解和操作。
                </li>
                <li>
                  <b>1.1.2 区域信息。</b>网页各信息区域应有服务类型和信息内容的描述与介绍，并提供对应的语音阅读服务，便利老年用户在访问过程中随时获得信息。
                </li>
                <li>
                  <b>1.1.3 关联性操作。</b>具有上下文关系或其他关联性关系界面组件的计算机网站、网页，应设有显著的操作引导文字或图片说明，以及相应的语音阅读服务。
                </li>
              </ul>
            </li>
            <li>
              <b>1.2 视觉呈现</b>
              <ul style="list-style: none">
                <li>
                  <b>1.2.1 页面布局。</b>网页布局设计应依照扁平化原则进行，避免阴影、透视、纹理等复杂装饰设计，也可独立提供内容简约的适老化大版块网页样式。
                </li>
                <li>
                  <b>1.2.2 区域辨识。</b>在展现服务信息的网页，对各信息服务区域以色彩差异进行区别，以方便老人用户辨识。
                </li>
                <li>
                  <b>1.2.3 字体大小。</b>在不依赖操作系统和浏览器的前提下，计算机适老化网页应提供网页的放大设置与大字屏幕服务，移动网页至少提供一种18dp/pt及以上的大字体。
                </li>
                <li>
                  <b>1.2.4 焦点状态。</b>鼠标，或指点，或键盘操作，或以其他方式聚焦到页面各组件时，该组件应有明显的状态提示。
                </li>
              </ul>
            </li>
            <li>
              <b>1.3 听觉感知</b>
              <ul style="list-style: none">
                <li>
                  <b>1.3.1 语音阅读。</b>适老化页面各组件和文本信息均应提供在线的语音阅读的适老化服务，至少要在正文页面中实现。
                </li>
                <li>
                  <b>1.3.2 阅读控制。</b>阅读控制。语音阅读服务应有开启和关闭阅读的设置，并可被辅助技术操作和控制，避免出现服务冲突。
                </li>
                <li>
                  说明：计算机网页的上述服务，应支持经过安全性和适配技术评估的第三方语音阅读技术，以及与操作系统适配好的第三方读屏软件。
                </li>
              </ul>
            </li>
            <li>
              <b>1.4 非文本处理</b>
              <ul style="list-style: none">
                <li>
                  <b>1.4.1 非文本链接。</b>以非文本形式的链接，应提供语音阅读其链接的目的或链接用途的适老化服务。
                </li>
                <li>
                  <b>1.4.2 非文本控件。</b>以非文本形式的控件或接受用户输入文本框，应提供语音阅读其目的或用途的适老化服务。
                </li>
                <li>
                  <b>1.4.3 验证码</b>
                  <ul style="list-style: none">
                    <li>
                      <b>（1）验证码放大：</b>如网页中存在非文本验证码，应提供相应的验证码放大服务，且验证码的放大倍数不低于2倍。包括字符、图形和各类拖拽形式的验证码。
                    </li>
                    <li>
                      <b>（2）验证码替代：</b>如网页中存在非文本验证码，至少提供一种视觉感官以外的验证码，如系统推送的语音验证码。
                    </li>
                    <li>说明：以上两种形式需要同时存在。</li>
                  </ul>
                </li>
                <li>
                  <b>1.4.4 验证码时效。</b>有时效限制且不超过3分钟时长的验证码，应为用户提供语音告知时效的服务，并提供延长时效设置。时效延长设置时长不低于原时效的2倍以上。
                </li>
              </ul>
            </li>
          </ul>
        </n-p>
        <n-h3>2. 可操作性</n-h3>
        <n-p>
          <ul style="list-style: none">
            <li>
              <b>2.1 可操作性要求</b>
              <ul style="list-style: none">
                <li>
                  在没有安全风险的条件下，适老化用户界面应开放组件访问接口，并可被语音控制或其他智能技术操作。
                </li>
              </ul>
            </li>
            <li>
              <b>2.2 操作接口</b>
              <ul style="list-style: none">
                <li>
                  <b>2.2.1 结构数据。</b>适老化界面组件应是层次清晰、信息完整的关系结构。
                </li>
                <li>
                  <b>2.2.2 接口开放。</b>无财务交易或用户信息完全风险的网页，应开放其内容的关系结构访问接口，支持语音控制等智能软件操作。
                </li>
              </ul>
            </li>
            <li>
              <b>2.3 多媒体控制</b>
              <ul style="list-style: none">
                <li>
                  多媒体播放控制。视频、音频等多媒体信息的播放控制，可通过键盘或智能手势完成。
                </li>
              </ul>
            </li>
            <li>
              <b>2.4 广告插件及诱导类按键限制</b>
              <ul style="list-style: none">
                <li>
                  <b>2.4.1 禁止广告插件。</b>提供适老化服务的网页或独立的适老化网站，网页中严禁出现广告内容及插件，也不能随机出现广告或临时性的广告弹窗。
                </li>
                <li>
                  <b>2.4.2 禁止诱导类按键。</b>提供适老化服务的网页或独立的适老化网站中无诱导下载、诱导付款等诱导式按键。
                </li>
              </ul>
            </li>
            <li>
              <b>2.5 漂浮窗体控制</b>
              <ul style="list-style: none">
                <li>
                  <b>2.5.1 漂浮窗体时机。</b>网页中如有漂浮窗体，尽可能在网页加载时与网页同步出现，并提供一个长期关闭的机制。
                </li>
                <li>
                  <b>2.5.2 临时漂浮窗体。</b>如网页需要临时出现漂浮窗体，应有一种告知方式，并提供一个长期关闭的机制。
                </li>
                <li>
                  说明：本要求是针对宣传类且无指向链接的漂浮窗要求，对面向当前用户办理业务的告知类窗体不做限制。
                </li>
              </ul>
            </li>
            <li>
              <b>2.6 信息输入处理</b>
              <ul style="list-style: none">
                <li>
                  <b>2.6.1 错误预防。</b>对于会导致使用者发生法律承诺或财务交易的网页，提交动作是可逆的，且提交可在10分钟内予以撤销，或在10分钟内支持修改和再次提交。
                </li>
                <li>
                  说明：该细则不包括对于商家促销且影响其他用户公平等形式的财务交易（如秒杀活动）。
                </li>
                <li>
                  <b>2.6.2 区域辨识。</b>网页中的各信息服务区域，任一表现形式（如纯文字、大版块等），应设有功能、目的和内容的语音告知服务，方便老年用户理解和进行下一步操作。
                </li>
              </ul>
            </li>
          </ul>
        </n-p>
        <n-h3>3. 可理解性</n-h3>
        <n-p>
          <ul style="list-style: none">
            <li>
              <b>3.1 信息及操作表达</b>
              <ul style="list-style: none">
                <li>
                  <b>3.1.1 专业词语与新词语。</b>提供适老化服务的网站栏目或服务，避免采用专业词语或网络新词语作为访问目标和结果表达。如确有必要，应在用户操作前给予必要的提示。
                </li>
                <li>
                  <b>3.1.2 交互的统一性。</b>经适老化设计的网页界面，其组件的操作流程应与用户的常规操作流程认知保持一致。
                </li>
                <li>
                  <b>3.1.3 识别的一致性。</b>提供适老化服务的网站，避免修改公认的通用名称或功能标识，如确有必要，则应提供必要的说明机制。
                </li>
                <li>
                  <b>3.1.4 位置告知和纠错。</b>应提供告知当前状态、位置和组件关系的机制以指导用户操作，并设有撤销上一步操作的动作。
                </li>
              </ul>
            </li>
          </ul>
        </n-p>
        <n-h3>4. 兼容性</n-h3>
        <n-p>
          <ul style="list-style: none">
            <li>
              <b>4.1 兼容性要求</b>
              <ul style="list-style: none">
                <li>
                  适老化版本应兼容各主流操作系统和各主流浏览器、盲用读屏等各种辅助软件，以及语音识别等智能技术的访问和操作。
                </li>
              </ul>
            </li>
            <li>
              <b>4.2 界面组件</b>
              <ul style="list-style: none">
                <li>
                  <b>4.2.1 组件样式。</b>适老化页面的组件样式应支持主流浏览器和主流操作系统，不应因用户使用的浏览器或操作系统不同而发生变化。
                </li>
                <li>
                  <b>4.2.2 组件服务。</b>适老化网页的组件服务数据内容，可以按照老年人生活实际需求情况进行提供。如在适老化网页上提供“社保查询、天气查询”等组件。
                </li>
              </ul>
            </li>
          </ul>
        </n-p>
        <n-h3>5. 特别性要求</n-h3>
        <n-p>
          <ul style="list-style: none">
            <li>
              <b>5.1 口述网页结构服务。</b>
              <ul style="list-style: none">
                <li>
                  应对当前网页的信息结构、区域组成和服务功能的整体描述提供语音阅读服务。
                </li>
              </ul>
            </li>
            <li>
              <b>5.2 实时读屏服务。</b>
              <ul style="list-style: none">
                <li>
                  应提供用户操作一致的语音阅读服务，并提供开启和关闭切换设置，以避免与语音识别等智能软件冲突。
                </li>
              </ul>
            </li>
            <li>
              <b>5.3 完整性服务。</b>
              <ul style="list-style: none">
                <li>
                  提供适老化服务的计算机网站和移动网站，应提供直接进入适老化服务的网站快捷通道或客户端。
                </li>
              </ul>
            </li>
          </ul>
        </n-p>
      </section>
    </article>
  </n-layout>
</template>
<script setup lang="ts"></script>
